Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: Teachers must consider carefully what, how and why pupils learn, and how they
nn: kva, korleis og kvifor elevane lærer, og korleis dei best mogleg kan leie og støtte læringa,

source: Politics and democracy
nn: Politikk og demokrati

source: Food does not come from the frozen foods section
nn: Maten blir ikkje fødd i frysedisken

source: discuss and elaborate on issues about the use and abuse of alcohol and other substance abuse
nn: drøfte spørsmål omkring og konsekvensar av bruk og misbruk av tobakk og ulike rusmiddel

source: The grade awarded for coursework shall reflect the overall competence of the pupil in Norwegian after completing Vg3.
nn: Standpunktkarakteren skal vere uttrykk for den samla kompetansen eleven har i norsk ved avsluttinga av opplæringa etter vg3.

source: Well-being in kindergarten and school go hand in hand
nn: Trivsel i barnehage og på skole går hand i hand

source: And they received help faster.
nn: Då fekk dei tidlegare hjelp.

source: The pupils also demonstrate and develop competence when using knowledge and skills to formulate and solve problems relating to everyday life and society.
nn: Elevane viser og utviklar òg kompetanse når dei bruker kunnskap og ferdigheiter til å formulere og løyse problem som er knytte til kvardagen og samfunnet.

source: elaborate on which national minorities exist in Norway, and describe the main characteristics of the history and living conditions of these minorities
nn: gjere greie for kva for nasjonale minoritetar som finst i Noreg, og beskrive hovudtrekk ved historia og levekåra til minoritetane

source: assess their significance for the division and legitimacy of power and opportunities for democratic participation
nn: dei har betydd for fordeling og legitimering av makt og for folks moglegheiter til demokratisk deltaking

source: This main subject area focuses on examining and discussing how man and society have changed over the centuries.
nn: Hovudområdet dreier seg om undersøking og drøfting av korleis menneske og samfunn har forandra seg gjennom tidene.

source: She opened her box of raisins in short order and is quietly observing Marie and her struggle.
nn: Ho har for lengst fått opna pakka si med rosiner og ser stille på Marie og strevet hennar.

source: They also demonstrate and develop competence when they apply and reflect on natural-science practices and approaches and natural-science technology.
nn: Vidare viser og utviklar dei kompetanse når dei anvender og reflekterer over naturvitskaplege praksisar og tenkjemåtar og naturvitskapleg teknologi.

source: Assessing and critically evaluating conclusions and representations of data are key elements in statistics.
nn: Å vurdere og sjå kritisk på konklusjonar og framstilling av data er sentralt i statistikk.

source: commutative, associative and distributive properties to
nn: kommutative, assosiative og distributive eigenskapar til å

source: discuss and elaborate on the value of human life, and place racism and discrimination in a historical and contemporary perspective with pupils from other schools by using digital communication tools
nn: drøfte menneskeverd, rasisme og diskriminering i eit historisk og notidig perspektiv med elevar frå andre skular ved å bruke digitale kommunikasjonsverktøy

source: in Media and information knowledge involves being able to understand and interpret a variety of media texts.
nn: i medie- og informasjonskunnskap inneber å forstå og tolke ulike medietekstar.

source: The debate has been hard and polarized.
nn: Debatten har vore både hard og polarisert.

source: Being able to express oneself orally and in writing
nn: gjere greie for celledeling og for genetisk variasjon og arv

source: Not only do they get physical, but they also get emotional impressions when they play outdoors’, observes Kathrine Bjørgen.
nn: Dei får ikkje berre kroppslege, men også kjenslemessige inntrykk når dei leiker utadørs, seier Kathrine Bjørgen.

source: School shall facilitate for learning for all pupils and stimulate eachpupil's motivation, willingness to learn and faith in their own mastering.
nn: Skolen skal leggje til rette for læring for alle elevar og stimuleremotivasjonen, lærelysta og trua på eiga meistring hos den enkelte.Læringa og utviklinga til elevane skal stå i sentrum for skoleverksemda.

source: in Media and information knowledge involves finding, receiving, handling, integrating and evaluating information as a basis for further work with different forms of expression in one’s own productions.
nn: i medie- og informasjonskunnskap inneber å finne, ta imot, handtere, integrere og evaluere informasjon som basis for vidare arbeid med ulike uttrykksformer i eigen produksjon.

source: This includes critically and analytically reading and interpreting maps, images, tables and figures, and reference works.
nn: Det inneber å lese og tolke kart, bilete, tabellar og figurar og oppslagsverk kritisk og analytisk.

source: The aim of Eik and Steinnes’ project has been to gather kindergarten teachers and head teachers from two different kindergartens, one municipal and one private, for group discussions and seminars.
nn: Prosjektet til Eik og Steinnes gjekk ut på å samle barnehagelærarar og styrarar frå to ulike barnehagar, éin kommunal og éin privat, til gruppesamtalar og seminar.

source: Assessing results and discussing measurement uncertainty are important elements of the measuring process.
nn: Vurdering av resultatet og drøfting av måleusikkerheit er viktige delar av måleprosessen.

source: Well-developed structures for collaboration, support and guidance
nn: Velutvikla strukturar for samarbeid, støtte og rettleiing mellom

source: the opportunities and challenges related to diversity
nn: moglegheiter og utfordringar ved mangfald

source: practice fair play by using own skills and knowledge in cooperation with others
nn: forklare og utføre livberging i vatn og livbergande førstehjelp

source: The pupils shall learn about the values and traditions which
nn: Elevane skal lære å kjenne dei verdiane og tradisjonane som bidrar til å samle

source: understand basic dilemmas and developments in society, and how they can be dealt with.
nn: forstå grunnleggjande dilemma og utviklingstrekk i samfunnet og korleis dei kan handterast.

source: It focuses on indigenous peoples, ethnic and national minorities and how xenophobia and racism can be countered.
nn: Det handlar om urfolk, etniske og nasjonale minoritetar og korleis framandfrykt og rasisme kan motarbeidast.

source: However, they also saw children who were overlooked, or who were not understood, and who spent a lot of time alone, according to Seland.
nn: Men dei såg også barn som ikkje vart sett, eller som ikkje vart forstått, og som gjekk mykje åleine, fortel Seland.

source: Curriculum for the elective subject of Democracy in practice (DIP1-01)
nn: Læreplan i valfaget reiseliv (RSL1-01)

source: orient themselves using maps and a compass in varied terrain and elaborate on other ways of getting their bearings
nn: orientere seg ved hjelp av kart og kompass i variert terreng, og gjere greie for andre måtar som ein òg kan orientere seg på

source: converse about variations in types of families and about the relationships and tasks of a family
nn: samtale om variasjonar i familieformer og om relasjonar og oppgåver i familien

source: explore the past by formulating research questions, assessing and
nn: reflektere over korleis fortida formar oss som menneske, og korleis

source: explore and argue for formulas for area and volume of three-
nn: utforske og argumentere for formlar for areal og volum av

source: carry out calculations on chemical equilibriums and discuss the equilibriums
nn: gjennomføre forsøk med lys, syn og fargar, og beskrive og forklare resultata

source: It also involves the derivation and integration of central functions in modelling and calculations.
nn: Funksjonar kan uttrykkjast på fleire måtar, til dømes med formlar, tabellar og grafar.

source: They are the most important caregivers for children and young people and
nn: Dei er dei viktigaste omsorgspersonane for barna og

source: perform texts for fellow pupils in Norwegian or Sign Language
nn: variere stemmebruk og intonasjon i framføring av tekstar

source: The competence concept also
nn: Kompetanseomgrepet omfattar òg forståing og

source: The teacher shall facilitate for pupil participation and stimulate their desire to learn by facilitating for varied, practical and exploratory ways of working.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst gjennom å leggje til rette for varierte, praktiske og utforskande arbeidsmåtar.

source: Statistics covers planning studies and collecting, organizing, analysing and presenting data.
nn: Statistikk omfattar å planleggje, samle inn, organisere, analysere og presentere data.

source: The aims of the studies are to enable pupils to
nn: praktisere ulike former for friluftsliv i ulike naturmiljø

source: reflect on ethical issues and challenges in their encounter with the media in different cultures
nn: reflektere over etiske problemstillingar og utfordringar i møtet mellom medium og ulike kulturar

source: People interact through language and forms of expression that are characteristic of the culture they are growing into.
nn: Mennesket samhandlar gjennom språk og uttrykksformer som er prega av den kulturen dei veks inn i.

source: It calls for expertise to identify and take advantage of the educational opportunities that arise in kindergarten.
nn: Det krev kompetanse å oppdage og bruke dei pedagogiske moglegheitene i barnehagen.

source: However, it is not easy to squeeze questions into a busy schedule.
nn: I ein travel kvardag er det derimot ikkje så lett å finne tid.

source: This also means engaging in conversation, communicating ideas and discussing and elaborating on problems and solution strategies with others.
nn: Det inneber òg å vere med i samtalar, kommunisere idear og drøfte problem og løysingsstrategiar med andre.

source: A common framework gives and shall give room for
nn: Ei felles ramme gir og skal gi rom for mangfald, og elevane skal få

source: develop, prepare and present a product
nn: utvikle, lage og presentere eit produkt

source: discuss the form, content and purpose of literature, theatre and films and present interpretative readings and dramatisations
nn: samtale om form, innhald og føremål i litteratur, teater og film og framføre tolkande opplesing og dramatisering

source: Naturally, however, there are major differences between the outdoor environments from one kindergarten to the next”, Bjørgen points out.
nn: Men her er det sjølvsagt store forskjellar i tilbodet i utemiljø mellom barnehagane, seier Bjørgen.

source: talk about the recommendations for a healthy diet from the health authorities, and give examples of the connection between diet, health and lifestyle
nn: samtale om tilrådingane for eit sunt kosthald frå helsestyresmaktene, og gi døme på samanhengen mellom kosthald, helse og livsstil

source: Knowledge about food and meals that can promote good eating habits may help to reduce health inequalities in the population.
nn: Kunnskap om mat og måltid som fremjar gode matvanar, kan gjere sitt til å redusere helseskilnader i befolkninga.

source: explain how production and consumption can destroy ecosystems and pollute soil, water and air, and discuss and elaborate on how this might be prevented and repaired
nn: beskrive korleis produksjon og forbruk kan øydeleggje økosystem og forureine jord, vatn og luft, og drøfte korleis dette kan hindrast og reparerast

source: Competence includes understanding and the ability to reflect and think critically.
nn: Kompetanse inneber forståing og evne til refleksjon og kritisktenking.

source: More knowledge motivates and stimulates the ability to analyse critically and understand comprehensively.
nn: Meir kunnskap motiverer og stimulerer evna til kritisk analyse og heilskapsforståing.

source: Numbers and algebra in practice
nn: Tal og algebra i praksis

source: The ability to express oneself orally and in writing means being able to reflect on the content of meaning in texts, images, film and artefacts, and being able to compare, argue and discuss the value of information and sources, and in hypotheses and models.
nn: Skriftleg og munnleg uttrykksevne vil seie å kunne reflektere over meiningsinnhaldet i tekstar, bilete, film og gjenstandar, og å kunne samanlikne, argumentere og drøfte verdiar i informasjon og kjelder, i hypotesar og i modellar.

source: give an account of what constitutes information, and on the various types of information
nn: gjere greie for kva informasjon er, og kva for informasjonstypar som finst

source: The 116 responses they received indicate that most ECEC teachers are aware of the physical environment in ECEC institutions and use it to encourage children to explore mathematical concepts and contexts like location and direction.
nn: Dei 116 svara dei fekk, tydde på at dei fleste barnehagelærarar er merksame på det fysiske miljøet i barnehagen og bruker det når dei oppmuntrar barna til å utforske matematiske omgrep og samanhengar, til dømes plassering og retning.

source: The pupils shall be encouraged to experiment on their own in the subject.
nn: Læraren og elevane skal vere i dialog om elevane si utvikling i historie.

source: discuss what roles information agencies and lobbying play in a democracy
nn: diskutere kva for roller informasjonsbyrå og lobbyverksemd spelar i eit demokrati

source: Most likely, no one ever bothers to ask his opinion.
nn: Det er det truleg ingen som spør han om.

source: create narratives about people in the past and talk about differences and similarities then and now
nn: skape forteljingar om menneske i fortida og snakke om skilnader og likskapar før og no

source: listen to and be receptive to the arguments of others and use relevant and rational arguments in discussions
nn: lytte til og vere open for argumentasjon hos andre og bruke relevante og saklege argument i diskusjonar

source: Cekaite and Holm Kvist documented daily activities with a video camera in two kindergartens.
nn: Cekaite og Holm Kvist brukte videokamera til å dokumentere daglege aktivitetar i to barnehagar.

source: the causes of and initiatives that can be taken to prevent racism, discrimination and hate speech, and
nn: årsaker til og tiltak som kan førebyggje rasisme, diskriminering og hatefulle ytringar, og

source: plan, prepare and serve a meal in connection with holidays or parties and play the role of host
nn: planleggje og gjennomføre måltid i samband med høgtider eller fest og ha ei vertskapsrolle

source: This main subject area covers the political system on all levels and the welfare state.
nn: Hovudområdet omfattar det politiske systemet på alle nivå og velferdsstaten.

source: The pupils demonstrate and develop competence in the subject in year 4 when using well-reasoned strategies and representations in their work with the four arithmetical operations, and explaining their thought processes.
nn: Elevane viser og utviklar kompetanse i faget på 4. trinn når dei bruker formålstenlege strategiar og representasjonar i arbeidet med dei fire rekneartane og til å forklare tenkjemåtane sine.

source: them to texts from more recent times
nn: dei med tekstar frå nyare tid

source: knowledge about how pupils learn and what they know from before, and requires close
nn: krev kunnskap om korleis elevar lærer, kva dei kan frå før, og føreset tett oppfølging av den

source: give an account of the place of organisations in working life in Norway and the factors that determine wages and working conditions
nn: gjere greie for organisasjonane sin plass i det norske arbeidslivet og for faktorar som bestemmer lønn og arbeidsvilkår

source: They also demonstrate and develop competence when they apply the practices of the subject, and when they reflect on how natural-science knowledge is developed.
nn: Vidare viser og utviklar dei kompetanse når dei anvender praksisane i faget, og når dei reflekterer over korleis naturvitskapleg kunnskap blir utvikla.

source: Media ideologies and the development of information gaps in society – nationally and internationally – are included in the main subject area.
nn: Medieideologiar og utvikling av informasjonskløfter i samfunnet nasjonalt og internasjonalt høyrer med til hovudområdet.

source: develop through interaction with others and through physical and aesthetic activities which
nn: Elevane blir danna i møte med andre og gjennom å utfalde seg fysisk og estetisk på ein

source: give an account of the main principles on which the courts can try an administrative decision
nn: gjere greie for hovudprinsippa for at domstolane kan prøve eit forvaltingsvedtak

source: Social studies subject curriculum (SAF1-02)
nn: Læreplan i samfunnsfag (SAF1-02)

source: Children and young people will need to deal with the today's and tomorrow's challenges, and
nn: Barn og unge skal handtere dagens og morgondagens utfordringar, og vår felles framtid er

source: explain important changes in how people have obtained food and used
nn: utforske fortida ved å formulere problemstillingar, finne, vurdere og

source: The purpose of the social studies subject is to help create understanding and belief in fundamental human rights, democratic values and equality, and to encourage the idea of active citizenship and democratic participation.
nn: Føremålet med samfunnsfaget er å medverke til forståing av og oppslutning om grunnleggjande menneskerettar, demokratiske verdiar og likestilling og til aktivt medborgarskap og demokratisk deltaking.

source: define the concept of culture and explain how culture, gender roles and different forms of family and cohabitation vary from place to place, and how these have changed over time
nn: definere omgrepet kultur og gje døme på korleis kultur, kjønnsroller og familie- og samlivsformer varierer frå stad til stad og endrar seg over tid

source: explain and discuss cultural variations and elaborate on the opportunities and challenges in multicultural communities
nn: gje døme på og diskutere kulturelle variasjonar og drøfte moglegheiter og utfordringar i fleirkulturelle samfunn

source: Fair play and common rules for participation are important parts of the subject.
nn: Dessutan er fair play og felles reglar ein viktig del av faget.

source: Statistics, probability and combinatorics
nn: Statistikk, sannsyn og kombinatorikk

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring different representations and problem solving strategies and their competence in communication with mathematical terminology.
nn: Læraren skal gi rettleiing om vidare læring og tilpasse opplæringa slik at elevane kan bruke rettleiinga for å utvikle kompetansen sin i utforsking av ulike representasjonar og problemløysingsstrategiar og kompetansen sin i kommunikasjon med matematiske omgrep.

source: present technical information adapted for a given purpose and recipient, with and without digital tools
nn: presentere fagstoff som er tilpassa føremålet og mottakaren, med eller utan digitale verktøy

source: use basic grammatical and text structures of English orally and in writing
nn: planleggje og leie idretts- og danseaktivitetar saman med medelevar

source: ‘Photography was the area of ICT that was easiest for employees to talk about with the children’, the researcher found.
nn: Fotografering var det IKT-området som det var enklast for dei tilsette å snakke med barna om, erfarte forskaren.

source: Also included are typical features of information and entertainment, journalism, advertising and propaganda.
nn: Det dreier seg òg om typiske trekk ved informasjon og underhaldning, journalistikk, reklame og propaganda.

source: give an account of how different political parties present different values and interests, connect this to current social science issues and argue one's own point of view
nn: gjere greie for korleis ulike politiske parti fremjar ulike verdiar og interesser, knyte dette til aktuelle samfunnsspørsmål og argumentere for eige syn

source: The main area of communication focuses on using the English language to communicate.
nn: omfattar rørsleleik, skapande og utøvande dans og idrettsaktivitetar tilpassa føresetnadene hos elevane.

source: The pupils demonstrate and develop competence in Norwegian in the Vg3 Supplementary programme for general university and college admissions certification when they analyse, interpret and compare texts and explore the context of the texts.
nn: Elevane viser og utviklar kompetanse i norsk på vg3 påbygging til generell studiekompetanse når dei analyserer, tolkar og samanliknar tekstar og utforskar kontekstane til tekstane.

source: and can do, but a key purpose of assessment is also to promote learning and development.
nn: eit sentralt formål med vurderinga er òg å fremje læring og utvikling.

source: explain relations between natural resources, industry, settlements and living conditions
nn: forklare samanhengar mellom naturressursar, næringar, busetnad og levevis

source: collected data to make explanations,
nn: innsamla data til å lage forklaringar,

source: To present may also mean to illustrate and to demonstrate.
nn: Presentere kan òg bety å illustrere og å demonstrere.

source: The social studies subject shall thus provide deeper understanding of the relationship between social life and personal life, and stimulate recognition of the diversity in social forms and ways of living.
nn: Samfunnsfaget skal difor gje djupare forståing av forholdet mellom samfunnslivet og det personlege livet, og stimulere til erkjenning av mangfaldet i samfunnsformer og levevis.

source: We may also reflect on a subject, practical activities or our own learning.
nn: Det kan òg omfatte å bedømekvaliteten ved eit produkt eller ein prosess.

source: Pupils shall learn in school to respect the fact that people are different and
nn: Skolen skal òg skape respekt for at menneske er ulike, og elevane skal lære å

source: Marie cannot open her raisins.
nn: Marie kan ikkje opne rosinpakka si.

source: Other important topics are how to undertake health-promoting activities and work in an ergonomically correct way.
nn: Korleis ein kan drive helsefremjande aktivitet og arbeide ergonomisk rett, er òg viktige emne.

source: ‘That being said, they had two different ways of documenting’, Holmberg discovered.
nn: Men dei hadde likevel to ulike måtar å dokumentere på, oppdaga Holmberg.

source: are also Sami values and apply in the Sami school.
nn: Verdiane i formålsparagrafen er òg samiske

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics through playing, being creative, having a sense of wonder and talking about mathematics.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst ved at elevane får utforske matematikk gjennom å leike, vere kreative, undre seg og samtale om matematikk.

source: Bjørgen has observed and made video recordings of 24 children in a Norwegian kindergarten.
nn: Bjørgen har gjort observasjonar og videoopptak av 24 barn i ein norsk barnehage.

source: Pupils develop when they learn how to find correct answers, but also
nn: Danning skjer når elevane lærer korleis dei kjem fram til riktig svar, men òg når dei

source: Principles for education and all-round
nn: Prinsipp for læring, utvikling og danning

source: order numbers, amounts and forms based on their properties, compare
nn: ordne tal, mengder og former ut frå eigenskapar, samanlikne dei og
